app/controllers/plantations_controller.rb

SELECT "plantations".* FROM "plantations"
---
  def index
    @plantations = Plantation.all

INSERT INTO "plantations" ("Pname", "Productid", "created_at", "quality", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Pname", "Yukarı Dağ"], ["Productid", 1], ["created_at", Thu, 21 Nov 2013 19:15:03 UTC +00:00], ["quality", 1], ["updated_at", Thu, 21 Nov 2013 19:15:03 UTC +00:00]]
---
  def create
    @plantation = Plantation.new(plantation_params)

    respond_to do |format|
      if @plantation.save

SELECT "plantations".* FROM "plantations" WHERE "plantations"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_plantation
      @plantation = Plantation.find(params[:id])